AnywhereSoftware/B4X_Forum_Resources/B4R/Libraries/rLovyanGFXEx ESP32/rLovyanGFXEx/rLovyanGFXEx.cpp
#include "B4RDefines.h"

namespace B4R
{
	void B4RLOVYANGFXEX::Initialize(SubVoidTouch TouchSub)
	{
		// Init the driver instance and log which driver is used.

		#if defined(ESP32_2432S028)
		::Serial.println("Display Driver: ESP32_2432S028");
		gfx = new (be) LGFX;
		#endif

		#if defined(ESP32_SSD1306)
		::Serial.println("Display Driver: ESP32_SSD1306");
		gfx = new (be) SSD1306;
		#endif
		
		#if defined(ESP32_SH110x)
		::Serial.println("Display Driver: ESP32_SH110x");
		gfx = new (be) SH110x;
		#endif
		
		// Init the display instance.
		gfx->init();
		
		// Short delay to let init complete.
		delay(100);  
				
		// Set display rotation default to 0
		gfx->setRotation(0);
		
		// Set color depth to 24 bits for RGB888.
		// Actual number of colors displayed may be 18 bits (RGB666) depending display hardware.
		gfx->setColorDepth(24);		

		// Set the default background color
		backgroundColor = B4RLOVYANGFXEX_COLOR_BLACK;
		gfx->fillScreen(backgroundColor);

		// Set the brightness to max
		selectedBrightness = 255;
		gfx->setBrightness(selectedBrightness);

		// Set the default font (FONT0)
		selectedFont = FONT_DEFAULT;
		gfx->setFont(&Font0);

		// Init the RGB LED (positioned on the back of the device)
		pinMode(this->redPin, OUTPUT);              
		pinMode(this->greenPin, OUTPUT);
		pinMode(this->bluePin, OUTPUT);

		// Check if touch event is set to assign the B4R touch event
		if (TouchSub != NULL) {
			::Serial.println("Touch: enabled");
			// Assign the touch event
			this->TouchSub = TouchSub;
			FunctionUnion fu;
			fu.PollerFunction = Looper;
			pnode.functionUnion = fu;
			pnode.tag = this;
			if (pnode.next == NULL) {
				pollers.add(&pnode);
			}			
		}
	}

	ULong B4RLOVYANGFXEX::Height()
	{
		return (uint32_t)gfx->height();
	}

	ULong B4RLOVYANGFXEX::Width()
	{
		return (uint32_t)gfx->width();
	}

	ULong B4RLOVYANGFXEX::CenterX()
	{
		return (uint32_t)gfx->width() / 2;
	}

	ULong B4RLOVYANGFXEX::CenterY()
	{
		return (uint32_t)gfx->height() / 2;
	}

	void B4RLOVYANGFXEX::Clear()
	{
		gfx->clear();
	}

	void B4RLOVYANGFXEX::ClearSetColor(ULong color)
	{
		gfx->clear((uint32_t) color);
	}

	void B4RLOVYANGFXEX::ClearArea(Long x, Long y, Long w, Long h, ULong color)
	{
		gfx->fillRect(x, y, w, h, color);
	}
	
	void B4RLOVYANGFXEX::setDisplayRotation(Byte direction)
	{
		gfx->setRotation( (int_fast8_t) direction);
	}

	Byte B4RLOVYANGFXEX::getDisplayRotation()
	{
		return (Byte) gfx->getRotation();
	}

	void B4RLOVYANGFXEX::SetColorDepth(int bits)
	{
		if (bits != 16 || bits != 24) { bits = 16; }
		gfx->setColorDepth(bits);
	}

	void B4RLOVYANGFXEX::setBrightness(Byte brightness)
	{
		selectedBrightness = brightness;
		gfx->setBrightness( (uint8_t) brightness);
	}
	Byte B4RLOVYANGFXEX::getBrightness()
	{
		return selectedBrightness;
	}
		
	void B4RLOVYANGFXEX::FillScreen(ULong color)
	{
		gfx->fillScreen((uint32_t)color);
		backgroundColor = color;
	}

	void B4RLOVYANGFXEX::setBackgroundColor(ULong color)
	{
		gfx->fillScreen((uint32_t)color);
		backgroundColor = color;
	}
	ULong B4RLOVYANGFXEX::getBackgroundColor()
	{
		return backgroundColor;
	}
	
	void B4RLOVYANGFXEX::SetTextColor(ULong color)
	{
		gfx->setTextColor( (uint32_t)color);
	}
	
	void B4RLOVYANGFXEX::SetTextSize(Double size)
	{
		gfx->setTextSize(size);
	}

	void B4RLOVYANGFXEX::SetTextSizeXY(Double sx, Double sy)
	{
		gfx->setTextSize((float)sx, (float)sy);
	}
		
	void B4RLOVYANGFXEX::SetTextDatum(Byte datum)
	{
		gfx->setTextDatum(datum);
	}
	
	void B4RLOVYANGFXEX::SetCursor(ULong x, ULong y)
	{
		gfx->setCursor( (int32_t) x, (int32_t) y);
	}
		
	void B4RLOVYANGFXEX::Print(B4RString* text)
	{
		gfx->print(text->data);
	}

	void B4RLOVYANGFXEX::Println(B4RString* text)
	{
		gfx->println(text->data);
	}

	void B4RLOVYANGFXEX::DrawText(ULong x, ULong y, B4RString* text, Byte textAlignment, double textSize, ULong textColor, ULong backgroundColor)
	{
		// Set text size, center text alignment and text color
		gfx->setTextSize(textSize);
		gfx->setTextDatum(textAlignment);
		gfx->setTextColor(textColor);

		// Check setting backgroundcolor
		if (backgroundColor != COLOR_DEFAULT) {
			// Calculate text bounding rectangle
			int textlen = text->getLength();
			int textWidth = textSize * FONT_HEIGHT_DEFAULT * textlen; // text length by character count
			int textHeight = textSize * FONT_HEIGHT_DEFAULT;

			// Clear the text area by filling it with the background color
			ULong rx = x - (textWidth/2);
			ULong ry = y - (textHeight/2);
			gfx->fillRect((int32_t)rx, (int32_t)ry, textWidth, textHeight,  backgroundColor);
		}

		// Draw the text
		gfx->drawString(text->data, x, y);
	}

	void B4RLOVYANGFXEX::DrawTextFont(ULong x, ULong y, B4RString* text, Byte textFont, Byte textAlignment, double textSize, ULong textColor, ULong backgroundColor)
	{
		B4RLOVYANGFXEX::setFont(textFont);
		B4RLOVYANGFXEX::DrawText(x, y, text, textAlignment, textSize, textColor, backgroundColor);
		B4RLOVYANGFXEX::setFont(FONT_DEFAULT);		
	}

	void B4RLOVYANGFXEX::DrawString(B4RString* text, ULong x, ULong y)
	{
		gfx->drawString(text->data, (int32_t)x, (int32_t)y);
	}

	void B4RLOVYANGFXEX::DrawNumber(Long value, ULong x, ULong y)
	{
		gfx->drawNumber(value, (int32_t)x, (int32_t)y);
	}

	void B4RLOVYANGFXEX::DrawFloat(float value, Byte dp, ULong x, ULong y)
	{
		gfx->drawFloat(value, dp, (int32_t)x, (int32_t)y);
	}

	void B4RLOVYANGFXEX::DrawLeftString(ULong x, ULong y, B4RString* text)
	{
		gfx->drawString(text->data, (int32_t)x, (int32_t)y);
	}
	
	void B4RLOVYANGFXEX::DrawCenterString(ULong x, ULong y, B4RString* text)
	{
		gfx->drawCenterString(text->data, (int32_t)x, (int32_t)y);
	}
	
	void B4RLOVYANGFXEX::DrawRightString(ULong x, ULong y, B4RString* text)
	{
		gfx->drawRightString(text->data, (int32_t)x, (int32_t)y);
	}
		
	UInt B4RLOVYANGFXEX::TextLength(B4RString* text)
	{
		// Get the text length by character count
		UInt textlen = text->getLength();

		// This is another option
		// char* c = (char*)text->data;
		// int textlen = strlen(c);
		return textlen;
	}

	UInt B4RLOVYANGFXEX::TextWidth(B4RString* text)
	{
		return (UInt) gfx->textWidth(text->data);
	}

	UInt B4RLOVYANGFXEX::TextWidthDefault(B4RString* text, double textSize)
	{
		UInt textlen = text->getLength();
		return textlen * textSize * FONT_HEIGHT_DEFAULT;
	}

	UInt B4RLOVYANGFXEX::TextHeight(double textSize)
	{
		return textSize * FONT_HEIGHT_DEFAULT;
	}

	ArrayByte* B4RLOVYANGFXEX::GetTextSize(B4RString* text, Byte font)
	{

		UInt Length = 3;
		Array* arr = CreateStackMemoryObject(Array);
		arr->data = StackMemory::buffer + StackMemory::cp;
		StackMemory::cp += Length;
		arr->length = Length;
		((Byte*)arr->data)[0] = gfx->textWidth(text->data);
		((Byte*)arr->data)[1] = gfx->fontHeight(font);
		((Byte*)arr->data)[2] = text->getLength();
		return arr;
	}

	/**
	* FONT
	*/

