AnywhereSoftware/B4X_Forum_Resources/B4R/Libraries/rLovyanGFXEx ESP32/rLovyanGFXEx/rLovyanGFXEx.cpp
	Long B4RLOVYANGFXEX::FontHeight()
	{
		return selectedFontHeight;
	}

	Long B4RLOVYANGFXEX::FontWidth()
	{
		// For some fonts the width is 0, then use textstyle x with size 1
		if (selectedFontWidth == 0) {
			selectedFontWidth = gfx->fontWidth(1);
		}
		return selectedFontWidth;
	}

	ULong B4RLOVYANGFXEX::FontHeightY(Byte font)
	{
		return gfx->fontHeight(font);
	}

	ULong B4RLOVYANGFXEX::FontWidthX(Byte font)
	{
		return gfx->fontWidth(font);
	}

	// Set the font to be used.
	// Important are the class properties selectedFontHeight and Width to determine the selected font size in px.
	// To get the full size in px multiply with fonr or text size.
	void B4RLOVYANGFXEX::setFont(Byte font)
	{
		switch (font) {
			
			selectedFont = font;
			
			case FONT_DEFAULT:
				gfx->setFont(&Font0);
				selectedFontHeight = gfx->fontHeight(&Font0);
				selectedFontWidth = gfx->fontWidth(&Font0);
				break;
			case FONT_FONT0:
				gfx->setFont(&Font0);
				selectedFontHeight = gfx->fontHeight(&Font0);
				selectedFontWidth = gfx->fontWidth(&Font0);
				break;
			case FONT_FONT2:
				gfx->setFont(&Font2);
				selectedFontHeight = gfx->fontHeight(&Font2);
				selectedFontWidth = gfx->fontWidth(&Font2);
				break;
			case FONT_FONT4:
				gfx->setFont(&Font4);
				selectedFontHeight = gfx->fontHeight(&Font4);
				selectedFontWidth = gfx->fontWidth(&Font4);
				break;
			case FONT_FONT6:
				gfx->setFont(&Font6);
				selectedFontHeight = gfx->fontHeight(&Font6);
				selectedFontWidth = gfx->fontWidth(&Font6);
				break;
			case FONT_FONT7:
				gfx->setFont(&Font7);
				selectedFontHeight = gfx->fontHeight(&Font7);
				selectedFontWidth = gfx->fontWidth(&Font7);
				break;
			case FONT_FONT8:
				gfx->setFont(&Font8);
				selectedFontHeight = gfx->fontHeight(&Font8);
				selectedFontWidth = gfx->fontWidth(&Font8);
				break;
			case FONT_FREEMONO_9:
				gfx->setFont(&FreeMono9pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeMono9pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeMono9pt7b);
				break;
			case FONT_FREEMONOBOLD_9:
				gfx->setFont(&FreeMonoBold9pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeMonoBold9pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeMonoBold9pt7b);
				break;
			case FONT_FREEMONO_12:
				gfx->setFont(&FreeMono12pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeMono12pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeMono12pt7b);
				break;
			case FONT_FREEMONOBOLD_12:
				gfx->setFont(&FreeMonoBold12pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeMonoBold12pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeMonoBold12pt7b);
				break;
			case FONT_FREESANS_9:
				gfx->setFont(&FreeSans9pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeSans9pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeSans9pt7b);
				break;
			case FONT_FREESANSBOLD_9:
				gfx->setFont(&FreeSansBold9pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeSansBold9pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeSansBold9pt7b);
				break;
			case FONT_FREESANS_12:
				gfx->setFont(&FreeSans12pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeSans12pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeSans12pt7b);
				break;
			case FONT_FREESANSBOLD_12:
				gfx->setFont(&FreeSansBold12pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeSansBold12pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeSansBold12pt7b);
				break;
			case FONT_TOMTHUMB_1:
				gfx->setFont(&TomThumb);
				selectedFontHeight = gfx->fontHeight(&TomThumb);
				selectedFontWidth = gfx->fontWidth(&TomThumb);
				break;
			case FONT_FREESERIF_12:
				gfx->setFont(&FreeSerif12pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeSerif12pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeSerif12pt7b);
				break;
			case FONT_FREESERIFBOLD_12:
				gfx->setFont(&FreeSerifBold12pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeSerifBold12pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeSerifBold12pt7b);
				break;
			case FONT_FREESERIFBOLD_24:
				gfx->setFont(&FreeSerifBold24pt7b);
				selectedFontHeight = gfx->fontHeight(&FreeSerifBold24pt7b);
				selectedFontWidth = gfx->fontWidth(&FreeSerifBold24pt7b);
				break;
			case FONT_ORBITRON_LIGHT_24:
				gfx->setFont(&Orbitron_Light_24);
				selectedFontHeight = gfx->fontHeight(&Orbitron_Light_24);
				selectedFontWidth = gfx->fontWidth(&Orbitron_Light_24);
				break;
			case FONT_ORBITRON_LIGHT_32:
				gfx->setFont(&Orbitron_Light_32);
				selectedFontHeight = gfx->fontHeight(&Orbitron_Light_32);
				selectedFontWidth = gfx->fontWidth(&Orbitron_Light_32);
				break;
			case FONT_ROBOTO_THIN_24:
				gfx->setFont(&Roboto_Thin_24);
				selectedFontHeight = gfx->fontHeight(&Roboto_Thin_24);
				selectedFontWidth = gfx->fontWidth(&Roboto_Thin_24);
				break;
			default:
				gfx->setFont(&Font0);
				selectedFontHeight = gfx->fontHeight(&Font0);
				selectedFontWidth = gfx->fontWidth(&Font0);
				break; 
		}	
	}

	Byte B4RLOVYANGFXEX::getFont(void)
	{
		return selectedFont;
	}
	
	/*
	NOT WORKING as IFont needs to be defined (included)
	void B4RLOVYANGFXEX::SetFont(IFont* font)
	{
		gfx->setFont(font);
	}

	void B4RLOVYANGFXEX::GetFontInfo(void)
	{
		 ::Serial.print("font:");
		 ::Serial.print("height=");
		 ::Serial.print(gfx->fontHeight());
		 ::Serial.print(",width=");
		 ::Serial.print(gfx->fontWidth());
		 ::Serial.print(",textwidth=");
		 ::Serial.print(gfx->textWidth("World"));
		 ::Serial.println();
	}
	*/

	/**
	* COLOR
	*/
	
	void B4RLOVYANGFXEX::SetColor(ULong color)
	{
		gfx->setColor( (int32_t)color);
	}
	
	void B4RLOVYANGFXEX::SetColorRGB(Byte r, Byte g, Byte b)
	{
		gfx->setColor( (uint8_t)r, (uint8_t)g, (uint8_t)b);
	}
	
	Byte B4RLOVYANGFXEX::Color332(Byte r, Byte g, Byte b)
	{
		return gfx->color332((uint8_t)r,(uint8_t)g,(uint8_t)b);
	}

	UInt B4RLOVYANGFXEX::Color565(Byte r, Byte g, Byte b)
	{
		return gfx->color565((uint8_t)r,(uint8_t)g,(uint8_t)b);
	}

	ULong B4RLOVYANGFXEX::Color888(Byte r, Byte g, Byte b)
	{
		ULong c = gfx->color888((uint8_t)r,(uint8_t)g,(uint8_t)b);
		return gfx->color888((uint8_t)r,(uint8_t)g,(uint8_t)b);
	}

