AnywhereSoftware/B4X_Forum_Resources/B4R/Libraries/rLovyanGFXEx ESP32/rLovyanGFXEx/rLovyanGFXEx.cpp
	ULong B4RLOVYANGFXEX::ColorRGB(Byte r, Byte g, Byte b)
	{
		ULong c = gfx->color888((uint8_t)r,(uint8_t)g,(uint8_t)b);
		return gfx->color888((uint8_t)r,(uint8_t)g,(uint8_t)b);
	}

	ULong B4RLOVYANGFXEX::Color16to24(ULong rgb565)
	{
		return gfx->color16to24( (uint32_t) rgb565);
	}
	
	/**
	* SPI bus
	*/

	/**
	* Secure SPI bus.
	*/
	void B4RLOVYANGFXEX::BeginTransaction(void)
	{
		gfx->beginTransaction();
	}

	/**
	* Release SPI bus.
	*/
	void B4RLOVYANGFXEX::EndTransaction(void)
	{
		gfx->endTransaction();
	}

	/**
	* Drawing Functions
	*/

	void B4RLOVYANGFXEX::StartWrite(bool transaction)
	{
		gfx->startWrite(transaction);
	}

	void B4RLOVYANGFXEX::EndWrite(void)
	{
		gfx->endWrite();
	}

	void B4RLOVYANGFXEX::DrawPixel( Long x, Long y, ULong color)
	{
		gfx->drawPixel( (int32_t) x, (int32_t) y, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::DrawPixelSize( Long x, Long y, UInt size, ULong color)
	{
		for (int i = 1; i <= size; i++) {
			for (int j = 1; j <= size; j++) {
				gfx->drawPixel( (int32_t) x + i, (int32_t) y + j, (uint32_t) color);
			}
		}
	}

	void B4RLOVYANGFXEX::DrawPixel4( Long x, Long y, ULong color)
	{
		B4RLOVYANGFXEX::DrawPixelSize( x, y, 4, color);
	}

	void B4RLOVYANGFXEX::DrawPixel8( Long x, Long y, ULong color)
	{
		B4RLOVYANGFXEX::DrawPixelSize( x, y, 8, color);
	}

	void B4RLOVYANGFXEX::DrawPixel16( Long x, Long y, ULong color)
	{
		B4RLOVYANGFXEX::DrawPixelSize( x, y, 16, color);
	}

	void B4RLOVYANGFXEX::DrawFastVLine ( Long x, Long y, Long h, ULong color)
	{
		gfx->drawFastVLine ( (int32_t) x, (int32_t) y, (int32_t) h, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::DrawFastHLine ( Long x, Long y, Long w, ULong color)
	{
		gfx->drawFastHLine ( (int32_t) x, (int32_t) y, (int32_t) w, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::DrawRect  ( Long x, Long y, Long w, Long h, ULong color)
	{
		gfx->drawRect  ( (int32_t) x, (int32_t) y, (int32_t) w, (int32_t) h, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::FillRect  ( Long x, Long y, Long w, Long h, ULong color)
	{
		gfx->fillRect  ( (int32_t) x, (int32_t) y, (int32_t) w, (int32_t) h, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::DrawRoundRect ( Long x, Long y, Long w, Long h, Long r, ULong color)
	{
		gfx->drawRoundRect ( (int32_t) x, (int32_t) y, (int32_t) w, (int32_t) h, (int32_t) r, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::FillRoundRect ( Long x, Long y, Long w, Long h, Long r, ULong color)
	{
		gfx->fillRoundRect ( (int32_t) x, (int32_t) y, (int32_t) w, (int32_t) h, (int32_t) r, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::DrawCircle( Long x, Long y, Long r, ULong color)
	{
		gfx->drawCircle( (int32_t) x, (int32_t) y, (int32_t) r, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::FillCircle( Long x, Long y, Long r, ULong color)
	{
		gfx->fillCircle( (int32_t) x, (int32_t) y, (int32_t) r, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::DrawEllipse( Long x, Long y, Long rx, Long ry , ULong color)
	{
		gfx->drawEllipse( (int32_t) x, (int32_t) y, (int32_t) rx, (int32_t) ry, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::FillEllipse( Long x, Long y, Long rx, Long ry, ULong color)
	{
		gfx->fillEllipse( (int32_t) x, (int32_t) y, (int32_t) rx, (int32_t) ry, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::DrawLine  ( Long x0, Long y0, Long x1, Long y1, ULong color)
	{
		gfx->drawLine( (int32_t) x0, (int32_t) y0, (int32_t) x1, (int32_t) y1, (uint32_t) color);
	}
	
	void B4RLOVYANGFXEX::DrawGradientLine ( Long x0, Long y0, Long x1, Long y1, ULong colorstart, ULong colorend)
	{
		gfx->drawGradientLine( (int32_t) x0, (int32_t) y0, (int32_t) x1, (int32_t) y1, (uint32_t) colorstart, (uint32_t) colorend);
	}

	void B4RLOVYANGFXEX::DrawWideLine ( Long x0, Long y0, Long x1, Long y1, double r, ULong color)
	{
		gfx->drawWideLine( (int32_t) x0, (int32_t) y0, (int32_t) x1, (int32_t) y1, (float) r, (uint32_t) color);
	}
		
	void B4RLOVYANGFXEX::DrawTriangle  ( Long x0, Long y0, Long x1, Long y1, Long x2, Long y2, ULong color)
	{
		gfx->drawTriangle( (int32_t) x0, (int32_t) y0, (int32_t) x1, (int32_t) y1, (int32_t) x2, (int32_t) y2, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::FillTriangle  ( Long x0, Long y0, Long x1, Long y1, Long x2, Long y2, ULong color)
	{
		gfx->fillTriangle( (int32_t) x0, (int32_t) y0, (int32_t) x1, (int32_t) y1, (int32_t) x2, (int32_t) y2, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::DrawBezier3( Long x0, Long y0, Long x1, Long y1, Long x2, Long y2, ULong color)
	{
		gfx->drawBezier( (int32_t) x0, (int32_t) y0, (int32_t) x1, (int32_t) y1, (int32_t) x2, (int32_t) y2, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::DrawBezier4( Long x0, Long y0, Long x1, Long y1, Long x2, Long y2, Long x3, Long y3, ULong color)
	{
		gfx->drawBezier( (int32_t) x0, (int32_t) y0, (int32_t) x1, (int32_t) y1, (int32_t) x2, (int32_t) y2, (int32_t) x3, (int32_t) y3, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::DrawArc( Long x, Long y, Long r0, Long r1, Long angle0, Long angle1, ULong color)
	{
		gfx->drawArc( (int32_t) x, (int32_t) y, (int32_t) r0, (int32_t) r1, (int32_t) angle0, (int32_t) angle1, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::FillArc( Long x, Long y, Long r0, Long r1, Long angle0, Long angle1, ULong color)
	{
		gfx->fillArc( (int32_t) x, (int32_t) y, (int32_t) r0, (int32_t) r1, (int32_t) angle0, (int32_t) angle1, (uint32_t) color);
	}

	void B4RLOVYANGFXEX::FloodFill( Long x, Long y, ULong color)
	{
		gfx->floodFill( (int32_t) x, (int32_t) y, (uint32_t) color);
	}

	/**
	* TEXTBOX
	*/

	void B4RLOVYANGFXEX::DrawTextBox(int x, int y, int w, int h, B4RString* text, ULong textColor, double textSize, ULong fillColor, ULong borderColor, int borderSize) {

		gfx->setTextSize(textSize);
		gfx->setTextDatum(MC_DATUM); // Center text alignment
		gfx->setTextColor(textColor);

		// Fill rectangle with background color
		gfx->fillRect(x, y, w, h, fillColor);

		// Draw border with specified thickness
		for (int i = 0; i < borderSize; i++) {
			gfx->drawRect(x + i, y + i, w - (i * 2), h - (i * 2), borderColor);
		}

		// Calculate center position
		int centerX = x + w / 2;
		int centerY = y + h / 2;

		// Draw centered text
		gfx->drawString(text->data, centerX, centerY);
	}

	void B4RLOVYANGFXEX::DrawTextBoxMultiLine(int x, int y, int w, int h, B4RString* line1, B4RString* line2, B4RString* line3, 
											 ULong textColor, double textSize, ULong fillColor, ULong borderColor, int borderSize) {
		gfx->setTextColor(textColor);

		// Fill rectangle with background color
		gfx->fillRect(x, y, w, h, fillColor);

		// Draw border with specified thickness
		for (int i = 0; i < borderSize; i++) {
			gfx->drawRect(x + i, y + i, w - (i * 2), h - (i * 2), borderColor);
		}

		// Text margins
		const int margin = 2;
		double availableHeight = h - (2 * margin);  // Available vertical space
		double availableWidth = w - (2 * margin);   // Available horizontal space
		double totalSpacing = 4 * margin;           // 2px spacing between each line (4 spaces)
		double lineHeight = (availableHeight - totalSpacing) / 3.0;  // Height per text line

		// If textSize is 0, auto-adjust based on height
		double maxTextSize = textSize;
		if (textSize == 0) {
			maxTextSize = floor(lineHeight / 8.0);
		}

