AnywhereSoftware/B4X_Forum_Resources/B4R/Libraries/rLovyanGFXEx ESP32/rLovyanGFXEx/rLovyanGFXEx.cpp
		// Get the longest line by character count
		B4RString* longest = line1;
		if (line2->getLength() > longest->getLength()) longest = line2;
		if (line3->getLength() > longest->getLength()) longest = line3;

		// Ensure text fits within the available width
		double maxWidthTextSize = maxTextSize;
		while ((longest->getLength() * (6 * maxWidthTextSize)) > availableWidth) {
			maxWidthTextSize -= 0.1;  // Reduce until it fits
			if (maxWidthTextSize < 1.0) {
				maxWidthTextSize = 1.0;
				break;
			}
		}

		// Use the smaller of height-based and width-based sizes
		maxTextSize = min(maxTextSize, maxWidthTextSize);

		// Ensure minimum text size of 1
		if (maxTextSize < 1.0) maxTextSize = 1.0;
		
		// Set text size
		gfx->setTextSize(maxTextSize);
		gfx->setTextDatum(MC_DATUM);  // Center text alignment

		// Calculate Y positions
		double centerX = x + (w / 2);
		double middleY = y + (h / 2);                          // Middle line
		double topY = middleY - (lineHeight + margin);         // First line (above middle)
		double bottomY = middleY + (lineHeight + margin);      // Third line (below middle)
		
		// Draw each line
		gfx->drawString(line1->data, centerX, topY);
		gfx->drawString(line2->data, centerX, middleY);
		gfx->drawString(line3->data, centerX, bottomY);
	}

	//TODO
	bool B4RLOVYANGFXEX::DrawImage(B4R::ArrayByte* data, ULong len, Long x, Long y, Long maxWidth, Long maxHeight, Long offX, Long offY, double scale_x, double scale_y, Byte datum)
	{
		// bool DrawImg(B4R::ArrayByte* data, uint32_t len, int32_t x=0, int32_t y=0, int32_t maxWidth=0, int32_t maxHeight=0, int32_t offX=0, int32_t offY=0, float scale_x = 1.0f, float scale_y = 0.0f, datum_t datum = datum_t::top_left)
		// gfx->draw_png(data->data, (uint32_t)len, (int32_t)x, (int32_t)y, (int32_t)maxWidth, (int32_t)maxHeight, (int32_t)offX, (int32_t)offY, scale_x, scale_y, datum);
	}

	/**
	* TOUCH
	*/

    void B4RLOVYANGFXEX::Looper(void* b) {
		// Touch sensivity delay in ms. Change if required.
		ULong TOUCH_DELAY = 150;
		
        B4RLOVYANGFXEX* me = (B4RLOVYANGFXEX*)b;
        
		uint16_t tX = 0, tY = 0;

		// Get the display touch height and width range 0 - NNN
		ULong touchHeight = me->Height() - 1;
		ULong touchWidth = me->Width() - 1;
		
		// If panel touched, 1 is returned
		if (me->gfx->getTouch(&tX, &tY) == 1) {
			
			// Set tX and tY by checking in range touchHeight, touchWidth
			if (tX < 1 || tX > touchWidth * 2) tX = 0;
			if (tX > touchWidth && tX < touchHeight * 2) tX = touchHeight;

			if (tY < 1 || tY > touchHeight * 2) tY = 0;
			if (tY > touchHeight && tY < touchHeight * 2) tY = touchHeight;
			
			// Call the touch handler in the B4R code
			me->TouchSub(tX, tY);
			
			// Short delay
			delay(TOUCH_DELAY);
		}
    }

	/**
	* RGBLED
	*/
	void B4RLOVYANGFXEX::SetRGBLEDColor(int redValue, int greenValue,  int blueValue)
	{
		// Important to take invert logic into account: 255 = OFF, 0 = ON	
		analogWrite(redPin,		255 - redValue);
		analogWrite(greenPin,	255 - greenValue);
		analogWrite(bluePin,	255 - blueValue);
	}

	void B4RLOVYANGFXEX::SetRGBLEDColorBrightness(int redValue, int greenValue, int blueValue, int brightnessValue)
	{
		double f = 0;
		if (brightnessValue > 0) { 
			// Cast the int brightnessvalue to a double else divide is rounded which is wrong
			f = (double)brightnessValue / 100;
		}
		// Important to take invert logic into account: 255 = OFF, 0 = ON	
		analogWrite(redPin,		255 - (redValue * f) );
		analogWrite(greenPin,	255 - (greenValue * f) );
		analogWrite(bluePin,	255 - (blueValue * f) );
	}
	
	void B4RLOVYANGFXEX::SetRGBLEDOff(void)
	{
		B4RLOVYANGFXEX::SetRGBLEDColor(0, 0, 0);
	}

	void B4RLOVYANGFXEX::setRGBLEDRed(int value)
	{
		B4RLOVYANGFXEX::SetRGBLEDColor(value, 0, 0);
	}
	int B4RLOVYANGFXEX::getRGBLEDRed(void)
	{
		return analogRead(redPin);
	}

	void B4RLOVYANGFXEX::setRGBLEDGreen(int value)
	{
		B4RLOVYANGFXEX::SetRGBLEDColor(0, value, 0);
	}
	int B4RLOVYANGFXEX::getRGBLEDGreen(void)
	{
		return analogRead(greenPin);
	}

	void B4RLOVYANGFXEX::setRGBLEDBlue(int value)
	{
		B4RLOVYANGFXEX::SetRGBLEDColor(0, 0, value);
	}
	int B4RLOVYANGFXEX::getRGBLEDBlue(void)
	{
		return analogRead(bluePin);
	}

	/**
	* BITMAP
	*/

	void B4RLOVYANGFXEX::DrawBitmap(int x, int y, int width, int height, ArrayByte* bitmap, ULong color, ULong backgroundColor)
	{
		uint8_t* data = (Byte*)bitmap->data;  // Get the pointer to the byte array

		gfx->startWrite();

		gfx->drawBitmap((int32_t)x, (int32_t)y, data, (int32_t)width, (int32_t)height, (uint32_t)color, (uint32_t)backgroundColor);

		gfx->endWrite();
	}

	void B4RLOVYANGFXEX::DrawIcon(int x, int y, int numRows, int numCols, Byte size, ArrayByte* bitmap, ULong color, ULong backgroundColor)
	{
		uint8_t* data = (uint8_t*)bitmap->data;  // Pointer to the byte array

		for (int row = 0; row < numRows; row++) {
			for (int col = 0; col < numCols; col++) {
				uint8_t byte = data[row];  // Get the byte representing the current row
				bool isPixelSet = byte & (0x80 >> col);  // Check if the bit is set for the column

				// Draw the pixel block based on the bit value (either the color or the background)
				DrawPixelSize(x + col * size, y + row * size, size, isPixelSet ? color : backgroundColor);
			}
		}
	}

	/**
	* BUTTON
	*/

	void B4RLOVYANGFXEX::DrawButton(int id, int x, int y, uint w, uint h, ULong fillcolor, ULong textcolor, B4RString* label, float textsize_x, float textsize_y, bool inverted)
	{
		auto style = gfx->getTextStyle();

		// Adjust textsize to fit button size. If too wide then textsize_x is set from textsize_y.
		textsize_x = textsize_x <= std::numeric_limits<float>::epsilon() ? textsize_x : textsize_y;
		textsize_y = textsize_y <= std::numeric_limits<float>::epsilon() ? textsize_x : textsize_y;
	
		gfx->setTextSize(textsize_x, textsize_y);
		gfx->setTextDatum(MC_DATUM);
		gfx->setTextPadding(0);

		auto fill = inverted ? (uint32_t)textcolor : (uint32_t)fillcolor;
		auto text = inverted ? (uint32_t)fillcolor : (uint32_t)textcolor;
		gfx->setTextColor(text, fill);

		// Corner radius
		uint_fast8_t r = (w < h ? w : h) >> 2;

