AnywhereSoftware/B4X_Forum_Resources/B4R/Libraries/rLovyanGFXEx ESP32/rLovyanGFXEx/rLovyanGFXEx.cpp
		gfx->startWrite();
		gfx->fillRoundRect(x, y, w, h, r, fill);
		gfx->drawString(label->data, x + (w/2), y + (h/2));
		gfx->endWrite();

		gfx->setTextStyle(style);
	}

	/**
	* HEADER
	*/
	void B4RLOVYANGFXEX::DrawHeader(B4RString* text, Byte font, Byte textalign, Byte textsize, ULong textcolor, ULong backgroundColor, ULong linecolor)
	{
		B4RLOVYANGFXEX::setFont(font);

		int h = B4RLOVYANGFXEX::FontHeight() * textsize;
		int w = B4RLOVYANGFXEX::Width();
		int x = 0;
		int y = 0;
		int offset = 2;

		gfx->fillRect(0, 0, w, h, backgroundColor);

		Byte textdatum;
		if (textalign == TEXT_ALIGN_LEFT){
			textdatum = TEXT_ALIGN_MIDDLE_LEFT;
			x = offset;
		}
		else if (textalign == TEXT_ALIGN_CENTER){
			textdatum = TEXT_ALIGN_MIDDLE_CENTER;
			x = w / 2;		
		}
		else if (textalign == TEXT_ALIGN_RIGHT){
			textdatum = TEXT_ALIGN_MIDDLE_RIGHT;
			x = w - offset;
		}
		else {
			textdatum = TEXT_ALIGN_MIDDLE_CENTER;
			x = w / 2;			
		}

		B4RLOVYANGFXEX::DrawText(x, y + (h/2), text, textdatum, textsize, textcolor, backgroundColor);

		// Draw red line below the header (optional)
		if (linecolor != COLOR_NONE) { B4RLOVYANGFXEX::DrawLine(0, y + h, w, y + h, linecolor); }
	}

	/**
	* FOOTER
	*/
	void B4RLOVYANGFXEX::DrawFooter(B4RString* text, Byte font, Byte textalign, Byte textsize, ULong textcolor, ULong backgroundColor, ULong linecolor)
	{
		B4RLOVYANGFXEX::setFont(font);

		int h = B4RLOVYANGFXEX::FontHeight() * textsize;
		int w = B4RLOVYANGFXEX::Width();
		int x = 0;
		int y = B4RLOVYANGFXEX::Height();
		int offset = 2;

		gfx->fillRect(0, y - h, w, h, backgroundColor);

		Byte textdatum;
		if (textalign == TEXT_ALIGN_LEFT){
			textdatum = TEXT_ALIGN_MIDDLE_LEFT;
			x = offset;
		}
		else if (textalign == TEXT_ALIGN_CENTER){
			textdatum = TEXT_ALIGN_MIDDLE_CENTER;
			x = w / 2;		
		}
		else if (textalign == TEXT_ALIGN_RIGHT){
			textdatum = TEXT_ALIGN_MIDDLE_RIGHT;
			x = w - offset;
		}
		else {
			textdatum = TEXT_ALIGN_MIDDLE_CENTER;
			x = w / 2;			
		}

		B4RLOVYANGFXEX::DrawText(x, y - (h / 2), text, textdatum, textsize, textcolor, backgroundColor);
		
		// Draw red line above the footer (optional)
		if (linecolor != COLOR_NONE) { B4RLOVYANGFXEX::DrawLine(0, y - h, w, y - h, linecolor); }
	}

}
